{
  "backend/main.mo": "Main backend actor implementing storage mixins, authorization, and data models for jobs, contacts, blogs, testimonials, users, and service pricing with CRUD logic.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components for contact and social link updates.",
  "frontend-file-summaries.txt": "Plain-text summaries of major frontend files describing responsibilities for hooks, components, constants, and SEO utilities.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, light/dark modes, and base styles.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main script.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to the sitemap.",
  "frontend/public/sitemap.xml": "Sitemap listing primary site routes with change frequencies and priorities.",
  "frontend/src/App.tsx": "Main app router configuration using TanStack Router with lazy-loaded pages and layout.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Admin route guard enforcing authentication and admin role before granting access to dashboard pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth state with UI feedback.",
  "frontend/src/components/jobs/JobCard.tsx": "Displays a job listing card with key details and buttons to apply or download the notification PDF.",
  "frontend/src/components/seo/Seo.tsx": "Sets document title, meta description, and injects LocalBusiness JSON-LD schema into the page.",
  "frontend/src/components/site/ContactSection.tsx": "Renders a contact form with validation and submission plus contact info cards.",
  "frontend/src/components/site/HeroSection.tsx": "Homepage hero with service highlights and buttons to scroll, navigate to jobs, or open WhatsApp.",
  "frontend/src/components/site/PortfolioSection.tsx": "Shows portfolio items organized in tabbed sections for designs, resumes, and projects.",
  "frontend/src/components/site/ServicesSection.tsx": "Displays service categories with pricing fetched from API and WhatsApp order links.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with business description, social links, and contact details including phone, WhatsApp, and email.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive header with navigation links, mobile drawer, and login button.",
  "frontend/src/components/site/SiteLayout.tsx": "Main site layout including header, footer, outlet, and WhatsApp button.",
  "frontend/src/components/site/TestimonialsSection.tsx": "Fetches and displays testimonials in a carousel with loading state handling.",
  "frontend/src/components/site/WhatsAppFloatingButton.tsx": "Floating WhatsApp contact button linking to primary number.",
  "frontend/src/constants/contact.ts": "Centralized contact info including WhatsApp numbers, email, channels, and location.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors and invalidates dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating jobs, categories, user roles, blogs, testimonials, and other backend data.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, theming, and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering App.",
  "frontend/src/pages/admin/AdminBlogPage.tsx": "Admin interface for creating, editing, deleting, and publishing blog posts using dialogs and mutation hooks.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for enabling or disabling job categories using toggles and category state data.",
  "frontend/src/pages/admin/AdminContactsPage.tsx": "Admin view of contact form submissions with the ability to delete entries.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard linking to all management sections such as jobs, categories, pricing, testimonials, contacts, and blog posts.",
  "frontend/src/pages/admin/AdminJobsPage.tsx": "Admin interface for listing, creating, editing, and deleting job posts with PDF upload and apply link validation.",
  "frontend/src/pages/admin/AdminServicePricingPage.tsx": "Admin page to manage service pricing entries, supporting add, edit, and delete operations via dialogs.",
  "frontend/src/pages/admin/AdminTestimonialsPage.tsx": "Admin UI for managing testimonials, allowing creation, editing, visibility toggling, and deletion.",
  "frontend/src/pages/BlogListPage.tsx": "Displays a list of published blog posts with loading state, SEO, and navigation to detail pages.",
  "frontend/src/pages/BlogPostPage.tsx": "Displays a single blog post with SEO metadata, handling loading, not-found states, and navigation back to the blog list.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with SEO metadata and multiple site sections including hero, services, portfolio, testimonials, and contact.",
  "frontend/src/pages/JobsPage.tsx": "Lists government job posts with search, category filtering, pagination, and SEO metadata.",
  "frontend/src/utils/officialDomainValidation.ts": "Validates apply URLs for HTTPS and official government domain patterns, returning warnings when invalid.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup for the frontend.",
  "project_state.json": "Describes project version, goals, architecture notes, constraints, and existing feature list for building a responsive website with services and a jobs portal. Includes known limitations and high-level functional requirements."
}